app/views/home/index.html.erb

<%= image_tag("cart.png",:class => "cart_image") %>
<% unless @cart.line_foods.empty? %>
---
SELECT "line_foods".* FROM "line_foods" WHERE "line_foods"."cart_id" = 5
SELECT COUNT(*) FROM "line_foods" WHERE "line_foods"."cart_id" = 6