app/views/carts/show.html.erb

SELECT "line_foods".* FROM "line_foods" WHERE "line_foods"."cart_id" = 4
SELECT COUNT(*) FROM "line_foods" WHERE "line_foods"."cart_id" = 11
---
<%= image_tag("cart.png",:class => "cart_image") %>
<% unless @cart.line_foods.empty? %>