app/controllers/foods_controller.rb

  def index
    @foods = Food.all
---
SELECT "foods".* FROM "foods" ORDER BY price

  def show
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? ORDER BY price LIMIT 1  [["id", "3"]]

  def edit
    @user = current_user
    @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? ORDER BY price LIMIT 1  [["id", "6"]]

  def create
    @food = Food.new(params[:food])

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("created_at", "desc", "img_url", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @food = Food.find(params[:id])

    respond_to do |format|
      if @food.update_attributes(params[:food])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? ORDER BY price LIMIT 1  [["id", "6"]]
UPDATE "foods" SET "price" = 78.99, "updated_at" = '2012-10-31 15:19:37.551836' WHERE "foods"."id" = 6