app/controllers/home_controller.rb

  def index
  	@user = current_user
  	@cart = current_cart
  	@foods = Food.all
---
SELECT "foods".* FROM "foods" ORDER BY price