app/controllers/line_foods_controller.rb

SELECT "line_foods".* FROM "line_foods"
---
  def index
    @line_foods = LineFood.all

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? ORDER BY price LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 30 Oct 2012 12:48:43 UTC +00:00], ["updated_at", Tue, 30 Oct 2012 12:48:43 UTC +00:00]]
INSERT INTO "line_foods" ("cart_id", "created_at", "food_id", "order_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 16], ["created_at", Wed, 31 Oct 2012 11:37:49 UTC +00:00], ["food_id", 2], ["order_id", nil], ["quantity", 1], ["updated_at", Wed, 31 Oct 2012 11:37:49 UTC +00:00]]
UPDATE "line_foods" SET "quantity" = 2, "updated_at" = '2012-10-30 13:01:07.723782' WHERE "line_foods"."id" = 1
---
  def create
   @cart = current_cart
   food = Food.find(params[:food_id])
   @line_food = @cart.add_food(food.id)

    respond_to do |format|
      if @line_food.save