app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if @cart.line_foods.empty?
---
SELECT COUNT(*) FROM "line_foods" WHERE "line_foods"."cart_id" = 16

  def create
    @order = Order.new(params[:order])
    @order.add_line_foods_from_cart(current_cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "payment", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 16]]