app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("created_at", "hashed_password", "img_url", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 31 Oct 2012 12:13:38 UTC +00:00], ["hashed_password", "123456"], ["img_url", "admin.jpg"], ["name", "admin"], ["salt", ""], ["updated_at", Wed, 31 Oct 2012 12:13:38 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save